"use strict";

/*
Необходимо попросить пользователя ввести число.
Если пользователь ввел отличное от числа значение, необходимо вывести в консоль
строку: "Значение задано неверно", иначе необходимо будет вызвать функцию 
(нужно будет ее создать), которая будет принимать введенное пользователем 
число. Функция должна вычесть из переданного ей числа 13% и вывести в консоль 
сообщение "Размер заработной платы за вычетом налогов равен N."
*/

// Здесь пишем решение, данный комментарий необходимо стереть.
const number = +prompt("Введите число:");
let check = isNumber(number)
if (check === true)  {
  promp(number);
}
else {
  console.log("Значение задано неверно")
}

function promp(numb){
  numb = numb - numb * 0.13;
  return console.log("Размер заработной платы за вычетом налогов равен N = ", numb);
}

function isNumber(val) {
  return /^[-]?\d+$/.test(val);
}
